{"url": "https://www.bbc.com/news/world-us-canada-67119183", "text": "A man has been charged with murder and hate crimes after allegedly stabbing two people because they were Muslim.Joseph Czuba, 71, is accused of killing a six-year-old boy and injuring a woman, 32, in Plainfield, Illinois.They were targeted because of the current conflict between Hamas and Israel, the Will County Sheriff's Office said.President Biden said he was \"sickened\" by the attack on the mother and her son, who were Palestinian-Americans.\"This horrific act of hate has no place in America, and stands against our fundamental values: freedom from fear for how we pray, what we believe, and who we are,\" Mr Biden said in a statement.\"As Americans, we must come together and reject Islamophobia and all forms of bigotry and hatred.\"Mr Czuba was charged with first-degree murder, attempted first-degree murder, hate crimes and aggravated battery.In Sunday's statement, the Will County Sheriff's Office said that on Saturday morning it received an emergency call from the woman who said she was being attacked by her landlord in Plainfield, near Chicago.The woman said she \"ran into the bathroom and continued to fight off her attacker\".When officers arrived at the scene they discovered the woman and the boy with \"multiple stab wounds to their chest, torso, and upper extremities\".Both victims were taken to hospital, but the boy later died. It was later established that the child was stabbed 26 times.\"The knife used in this attack is a 12-inch (31cm) serrated military style knife that has a seven-inch blade,\" the Sheriff's office said.The woman, who was seriously injured, is expected to survive the attack.Mr Czuba was found \"sitting upright outside on the ground near the driveway of the residence,\" the statement said.He was taken to hospital for treatment before being questioned by detectives.\"Detectives were able to determine that both victims in this brutal attack were targeted by the suspect due to them being Muslim and the ongoing Middle Eastern conflict involving Hamas and the Israelis,\" the Sheriff's office added.It has not publicly released the names of the victims.But at a news briefing later on Sunday, from the Chicago office of the Council on American-Islamic Relations (CAIR-Chicago), America's rights group, named the boy as Wadea al-Fayoume, and his mother as Hanaan Shahin.It said Wadea was born in the US, while his mother - originally from Beitunia in the West Bank - came to the country 12 years ago.CAIR-Chicago executive director Ahmed Rehab said Wadea had only celebrated his birthday a few weeks ago.\"He loved his family, his friends. He loved soccer, he loved basketball.\"And he paid the price for the atmosphere of hate and otherisation and dehumanisation that frankly I think we are seeing here in the United States as a result of the irresponsible leadership, lopsided, one-sided statements and coverage that we're seeing in the media, elected officials.\"And we warned about not recreating the same mistake we had in the post 9/11 environment,\" Mr Rehab said, adding that back then innocent members of a particular community had been victimised for the deadly attacks in the US in 2001.More than 1,400 people were killed in Israel last weekend when Hamas fighters crossed the border from the Gaza Strip to attack civilians and soldiers.In Gaza, more than 2,450 people have been killed by Israel's bombing, Palestinian authorities say, with an estimated 1,000 missing under rubble.Sign up for our morning newsletter and get BBC News in your inbox.© 2023 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking.", "summary": null, "sentiment": null}