{"url": "https://www.bbc.com/news/entertainment-arts-67098882", "text": "She's known as the Queen of Pop and, on the opening night of her Celebration World Tour, Madonna brought out her crown jewels.The star played more than 40 hits, including era-defining anthems like Ray Of Light, Like A Prayer and Holiday.She also addressed the infection that almost killed her this summer, telling fans: \"I didn't think I would make it - neither did my doctors\".And she expressed her sorrow over the situation in Israel and Gaza.\"It's so painful to witness,\" she said. \"It breaks my heart to see children suffering, teenagers suffering, elderly people suffering. I'm sure you agree.\"Watch footage from the first night of Madonna's tourThe concert was billed as Madonna's first-ever greatest hits set and, on that front, it did not disappoint.Aided by vintage costumes and archive footage, she time-travelled through a career that took her from penniless wannabe to musical icon, while highlighting her impact on popular culture.She opened with Nothing Really Matters, whose lyrics addressed fans directly: \"I'll never be the same because of you\".Performing alone, illuminated by a vast circular lighting rig, she was dressed in a black replica of the Gaultier-designed kimono from the song's video.That set the tone for an evening, where every song had an aural or visual Easter egg. At one point, I counted 18 Madonnas on stage, each sporting a different look - from the pink Hung Up leotard to the dominatrix costumes of Erotica.Even the three-tiered circular stage was designed to mirror the \"wedding cake\" from which she performed Like A Virgin at the 1984 MTV Awards.For fans, it was a deeply nostalgic trawl through a trend-setting, taboo-breaking pop career. For Madonna, it was frequently a family affair.The first act of the show was devoted to Madonna's pre-fame New York years, as she tried to break into the music scene while living in poverty.She recalled her first job as part of a band called The Breakfast Club.\"I played the drums [but] I didn't like being the drummer,\" she said. \"I really wanted to be in front.\"So they let me play one song, one night,\" she added, strapping on a guitar, and launching into one of her earliest singles, Burning Up.But as the song came to an end, the show ground to a halt.Technical gremlins had infected the sound system, which needed to be \"rebooted\", leaving Madonna with almost 10 minutes to fill.\"This is exactly what you don't want to happen on your opening night,\" she observed.Instead of taking the easy route and leaving the stage, as many artists would, she regaled the audience with stories about her scrappy New York days.\"I lived in the rehearsal space that my band practiced in, and I had no way to take a bath,\" she recalled at one point.\"So I would actually date men who had showers and bathrooms.\"Those were the days, and that is the truth.\"It was a moment of spontaneous humanity in a militarily-regimented show - but it wasn't the only one.An emotional version of Live To Tell was played against a backdrop of the friends Madonna lost to Aids - including Martin Burgoyne, who managed her first club tour; choreographer Alvin Ailey, who hired her for his dance troupe in the 1970s; Queen star Freddie Mercury, and many more.That segued into an angry version of Like A Prayer, suggesting the Aids epidemic had provoked a crisis of faith for the star in the late 80s.Her subsequent use of religious iconography often angered the Church. Pope John Paul II even called for Christians to boycott her 1990 Blond Ambition tour, calling it \"one of the most satanic shows in the history of humanity\".On stage at the O2 in London, Madonna recreated the sexually-explicit routine for Like A Virgin that had so upset the pontiff... cheekily adding the strings to \"Papa Don't Preach\" as a coda.She always gets the last word.Other highlights included a thunderous version of Vogue, presented as a drag ball; a 20,000-person singalong to Crazy For You; and the club mastery of Hung Up (including copious amounts of nudity from her dancers).The star looked and sounded incredible throughout, moving from one elaborate set-piece to the next with conviction and power, despite the knee support she required for a recurring injury.During Ray Of Light, she flew above the audience, lit by an array of lasers. Erotica presented love as a boxing match - a reminder of her tumultuous relationships, perhaps, but also a reference to her current boyfriend, boxing coach Josh Popper, who appeared on the video screens.There were also tributes to her pop contemporaries Michael Jackson, Sinead O'Connor and Prince (via the unreleased guitar solo he recorded for Like A Prayer).But the most touching moments were Madonna's interactions with her children.Mercy, 17, accompanied her mum on piano for Bad Girl, singing along while showing off prodigious melodic runs up and down the keyboard; while 11-year-old Stella joined in the choreography for the cowboy-themed Don't Tell Me.Her adopted son David also played guitar during Mother And Father - a 2003 song about the death of Madonna's mother, also called Madonna, when the singer was just five years old.As the music began, images of both Madonna Sr and David's birth mother Marita were beamed on the video screens, acknowledging how the loss of a parent has a lifelong impact, no matter your circumstances.Initially positioned at opposite ends of the stage, Madonna and David slowly moved towards each other, as the lyrics acknowledged a need to replace that loss with love: \"I got to let it go / Find someone that I can care for\".The strength of their bond was highlighted again when Madonna discussed the bacterial infection that forced her to delay this tour by three months.\"I woke up [in hospital] with all of my children around me,\" she recalled. \"I forgot five days of my life… or my death. I don't really know where I was.\"But the angels were protecting me. And if you want to know my secret and how I survived, I thought 'I've got to be there for my children. I have to survive for them'.\"The star then played an acoustic version of Gloria Gaynor's I Will Survive. When the song reached the lyric \"Did you think I'd lay down and die,\" she paused and demanded of the audience: \"Well, did you?\"Not every moment was so successful. The Bjork-penned Bedtime Stories felt superfluous, and did we really need a second version of Justify My Love (the obscure \"Beast Within\" remix, which quotes extensively from the Book of Revelations) when songs like Express Yourself and Frozen were discarded as snippets?The narrative, too, began to meander. After a strong autobiographical structure in the opening act, later sequences were hard to decipher.Madonna's reckonings with celebrity, sexism and ageism were referenced but left unresolved - with the closing medley of Bitch, I'm Madonna and Celebration apparently concluding that, after 40 years, her principal achievement is the very act of being Madonna.\"You will be crucified, you will be vilified, because to age is to sin,\" she explained, in a replay of her speech at the 2016 Billboard Women In Music Awards.\"I think the most controversial thing I've done is to stick around.\"It's a valid statement, but it somehow overlooks her impact on music - the constant reinvention and re-contextualisation of pop, and what it can represent.When Madonna started out, she made party music. Now, those same songs can be anthems of protest, self-discovery, allyship and freedom.That's a radical legacy - and a true cause for celebration.Outside the O2 Arena, there was a mixed reception to Madonna's opening night.\"It was excellent,\" said Scottish fan Jaclyn. \"I liked the bits where the sound went a bit funny and it actually felt like I was chatting with Madonna. That made it for me.\"\"Obviously it's hard to put 40 years into two hours, but I think she did a good job,\" said Italian fan Alessia Petralia, who said Madonna had \"made the world better for women and the gay community\".\"She is a true inspiration,\" agreed Lauren Barker. \"A lot of women who were in there aspire to be like Madonna. And she is probably the reason why I've become a successful businesswoman.\"\"A waste of time,\" argued one concertgoer, who did not give their name. \"It was all miming. Very disappointed. She never sung at all.\"\"It was disappointing,\" said another. \"There were too many interludes, not enough bangers. The crowd were sitting down in their seats. There was no atmosphere.\"Johnny, who flew in from New York, took the opposite view: \"Madonna is a perfectionist. When it comes to concerts, she always gives you extra. Ten out of 10 across the board.\"\"She always surpasses my expectations,\" added Laurent Sassine, from Haiti. \"Live To Tell brought me to tears, because I lost friends to Aids, also. That really moved me.\"© 2023 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking.", "summary": null, "sentiment": null}