{"url": "https://www.bbc.com/news/business-66926972", "text": "Last month the German government announced an additional €370m (£320m; $390m) in funding for nuclear fusion research and development.This brings the total budget earmarked for the next five years to €1bn.So is Germany about to take a leap forward in fusion engineering?\"We want to create a fusion ecosystem with industry, so that a fusion power plant in Germany becomes reality as quickly as possible,\" said Minister of Research, Bettina Stark-Watzinger.Nuclear fusion is the reaction that powers the sun. It produces vast amounts of energy by fusing together hydrogen nuclei.If it can be harnessed here on Earth, then it promises abundant, cheap, and emission-free electricity.But the engineering hurdles are daunting. Sparking a fusion reaction and keeping it going needs immense temperature and pressure, and will require technology that is yet to be invented.Private firms and government projects around the world have made much progress in recent years in overcoming the challenges.Germany's strength in engineering should put it in a strong position, but, for some, the fresh government investment has come too late.Marvel Fusion, one of four German fusion start-ups, has chosen to build its laser fusion facility in the US.The company's chief executive, Moritz von der Linden, said it was \"a disadvantage\" to be based in Germany.\"Things are moving too slowly, and they're not moving at scale. The main part missing in Germany is a clear political commitment that the government is supporting this, the next is subsidies,\" he told the Financial Times in February.That leaves three German fusion start-ups - Proxima Fusion, Gauss Fusion (both magnet-based fusion), and Focused Energy (laser-based fusion).They have agreed to collaborate in a number of key areas in a bid to accelerate research and development.They believe Germany's tradition of engineering excellence and world-class nuclear fusion research leaves the nation well-placed to drive reactor development.\"I think Germany has a really good story to tell on nuclear fusion,\" says Dr Arthur Turrell, author of The Star Builders: Nuclear Fusion and the Race to Power the Planet. \"It's home to one of the most exciting fusion experiments in the world, the Wendelstein 7-X.\"\"Some of the great breakthroughs, and really interesting experiments, have come out of Germany and out of German support for fusion and they're involved in a lot of international collaborations too.\"More technology of businessThe Max Planck Institute for Plasma Physics and the Karlsruhe Institute of Technology are just two of a number of research bodies that have been contributing to joint international efforts and have been making meaningful headway for years.Milena Roveda, chief executive of Gauss Fusion, agrees that Germany has the potential to play a pivotal role in making fusion energy a reality. \"Two of the greatest fusion research devices are in Germany. We have excellent physicists. In Germany, nothing [is lacking] except to say, 'Okay, we'll do it now'.\"She believes industry brings urgency and pragmatism to development that's often lacking in research institutes.\"I am convinced that we would already have fusion power on the grid here [in Germany] if industry had taken a role in this before,\" she says.Headquartered in Hanau, near Frankfurt, Gauss Fusion's roadmap sees the company opening fusion power plants by the beginning of the 2040s.Others also see the collaboration between research institutes and private enterprise as the pathway to get fusion power online as quickly as possible.\"I think 20 years is an aggressive but realistic timescale,\" says Tony Donné, chief executive at EUROfusion, a European consortium of 30 fusion research institutes. \"We can [get fusion reactors on the grid] provided we get our act together and we set up the project in a good way\".\"If industry had been involved in designing ITER [an international fusion research project based in France] they could have built it faster and cheaper.\"\"Research engineers from the institutes… think about the design and functionality but manufacturability is very low on their agenda. Ultimately, it needs to be industry who builds the reactors and the first fusion power plants,\" says Mr Donné.If a Manhattan Project-type collaboration between industry and research institutes were facilitated by the likes of the European Commission, says Mr Donné, the 20-year timeline could potentially be sped up.\"I saw the movie Oppenheimer recently. You'd need a similar type of project with a central team, clear leadership, clear governance, and also with the budget that you can build things fast.\" says Mr Donné.\"[Beyond that,] many private fusion companies promise fusion in five to ten years. This is just a pipe dream. It's like selling flying carpets.\"Several German companies already engineer individual components for fusion research, such as the optics used in laser experiments, and this is where Mr Donné thinks many may end up contributing to fusion reactors in the long-term.\"Since [public research institutes] work with taxpayers money, we are very risk-averse. [Private] companies are less risk-averse, more agile.\"\"If we can involve them in the development of new materials or in [generating fuel], we maybe could have solutions at a faster timescale.\"Both Donné and Roveda are keen to underline that fusion power plants are not a short-term solution and that even in the best possible conditions, could only become a reality in the second-half of the century. In the meantime, more immediate green solutions will be needed to reduce carbon emissions.\"There is still a long, long way to go, especially in Germany. But I think that with the war, [people] have seen how difficult our situation is going to be in future. We are dependent on foreign nations for supplying our energy. This is something we cannot do,\" says Ms Roveda.© 2023 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking.", "summary": null, "sentiment": null}