{"url": "https://www.bbc.com/news/world-asia-67063197", "text": "The words \"democratic Taiwan\" appeared more times in the island's national day celebrations this year than any other - by far.\"We have brought the international spotlight to Democratic Taiwan,\" declared President Tsai Ing-wen last week, in her last national day address before she steps down as the first democratically elected female president.\"The people of Taiwan will remain a democratic and free people for generations to come,\" she added. It was both an assertion of the island's identity and a call for the world to take note and not allow this vibrant and open society to disappear.The head of Taiwan's legislature, You Si-Kun, had touted those same credentials in his opening remarks: \"The UK's Economist Intelligence Unit ranks Taiwan the number one democracy in Asia and number 10 in the world.\"The importance of these words to Taiwan, which feels increasingly threatened by Chinese claims to its territory, cannot be overstated.\"Democratic Taiwan\" has become its brand - its pitch to the world for why this self-governed island of 23 million people matters, and why it should be protected from being gobbled up by China. And yet for an $800bn chip superpower Taiwan has very few official friends.There was a time when Taipei had a military alliance with the United States and a seat on the UN security council. It was run as an anti-Communist dictatorship and could count on support from like-minded regimes from Seoul to Santo Domingo, Pretoria to Panama City.Now those Cold War-era friends are almost all gone. The threat to Taiwan is more severe than ever and Taipei is in desperate need of new allies.That challenge was on sharp display at Tuesday's ceremony.\"Please welcome our honoured VIP guests to today's celebrations,\" announced the master of ceremonies. And along the red carpet came the president of Nauru, a Pacific micro-state of just 10,800 people. Next came the governor general of St Kitts and Nevis, a Caribbean state of 47,000 people, and finally the governor general of St Vincent and the Grenadines, a relative giant by Caribbean micro-state standards, with a population of 110,000.The front row of diplomatic seats was taken up by ambassadors from Guatemala, Paraguay, Haiti and Eswatini.The first two remain fragile democracies, battling unrest and corruption, while surging gang violence has claimed thousands of lives in Haiti this year alone. Eswatini is Africa's only remaining absolute monarchy, and Taiwan's only remaining African ally. Last month President Tsai flew all the way to the tiny kingdom to meet King Mswati III and mark the 55th anniversary of its independence.These are among Taiwan's 13 official diplomatic allies - all that remains of its Cold War-era alliances.Watch: China warship steers near US Navy in Taiwan StraitWhen he retreated to Taiwan from China in 1949, Generalissimo Chiang Kai-shek's regime in Taipei held on to big allies like the US and Japan all the way through the 1950s and 60s, when Mao Zedong's Communist China was cut off from the world.But then in February 1972 President Richard Nixon sat down with Mao Zedong in Beijing. It was an enormous moment that began the opening of Communist China to the world. It unleashed a cascade of diplomatic recognition for Beijing. Tokyo was among the first to switch. Washington followed in 1979.Chiang Kai-Shek died in Taipei in 1975, his dreams of retaking the Chinese mainland unfulfilled. But he'd handed power to his son and the island remained a one-party dictatorship that tortured and imprisoned its opponents.For most countries the argument for maintaining relations was gone. Those that did were on the whole equally nasty regimes, including the generals of South Korea, apartheid South Africa and the right-wing dictatorships of Central America.Increasingly Taipei relied on its chequebook to hold on to a dwindling list of allies, mainly in the form of aid and investment.But today China's cheque book is bigger than Taiwan's - and its economy vastly more important. The allies that remain are tiny and of little help in protecting Taiwan from an assertive China.Of course this doesn't mean there are none.Perhaps it's no surprise that at Tuesday's national day celebrations the biggest applause was reserved for two visiting marching bands. One was from Tokyo and the other from Los Angeles - Japan and the US, which are still the two countries Taiwan cares about and needs the most.Even after switching recognition, Washington continued to quietly support Taiwan, selling billions of dollars worth of weapons to the island. Its unofficial embassy in Taipei is a vast compound euphemistically called \"The American Institute in Taiwan\".Walk down any back street in Taipei and you can't help but notice the astonishing number of Japanese restaurants, filled with Japanese businessmen. Japan's westernmost island - Yonaguni - is just 110km (68 miles) from Taiwan's east coast. Tokyo cares deeply what happens to Taiwan. During a recent speech in Taipei former Japanese Prime Minister Taro Aso called on the international community to \"wake up\" to the threat from China.These relations remain \"unofficial\" - even at the parade they were relegated to the shadows, much like their friendships.Spooked by China's incessant military drills and left out of key alliances, Taiwan is looking to make new friends - not just to trade with, but for support in powerful international bodies, in particular the European Union.Proof of one new friendship is easily visible in Taipei's supermarkets, which now sell something that is quite uncommon in Asia: Lithuanian-made India Pale Ale. Imports of the brew, along with Lithuanian rum and chocolate, have soared in Taiwan in the last few years, and Taipei has even announced a $10m investment in Lithuania in the most prized Taiwanese product - chips.Why Lithuania? Perhaps the most fertile ground for making new friends is in the young democracies of Eastern Europe, places that once fell under the control of Moscow, but are now part of Nato and the EU.During his speech to the national day crowds, the head of Taiwan's parliament warned of authoritarian regimes \"rolling back freedom, from Ukraine to Hong Kong, Myanmar to Afghanistan\".From the Czech Republic to Poland, Georgia to Lithuania, there are many countries that fear a resurgent Russia and perhaps feel a kindred spirit for a small democracy living next door to a huge authoritarian state that claims it should not exist.In 2021 Lithuania allowed Taipei to set up an office in Vilnius using the name \"Taiwanese Representative Office in Lithuania\".Beijing was apoplectic and sent Lithuania's ambassador to Beijing home. Further intimidation has followed. But the government in Vilnius has refused to back down. It has gone further, describing its relations with Taipei as a \"strategic priority\".\"Lithuania is seeking to enhance practical co-operation with Taiwan, a like-minded democracy, and an important economic and technological partner in the region,\" it says.While the IPA on Taiwanese supermarket shelves may seem like a small thing, it is an indication of where Taiwan wants to go.It is not looking to dump its old allies. The president of Nauru will still be welcome at national day 2024.But if Taiwan had a Tinder profile it might read: \"Young democracy, with open society and thriving high-tech economy, looking to make new strong friendships with like-minded partners. Next door neighbour, a problem.\"© 2023 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking.", "summary": null, "sentiment": null}