{"url": "https://www.bbc.com/news/world-europe-67118795", "text": "The exit polls from Poland's election have Eurocrats grinning like Cheshire cats.After years of estrangement and antagonism, Poland's centrist opposition Civic Coalition, has a simple message for Brussels: \"We, the fifth-largest country in the EU fold, are back!\"The fact that they're led by former European Council chief Donald Tusk means the EU believes them.Brussels has been deeply worried about Poland's election.Little was said in public. EU figures don't want to be seen as interfering in national votes, but behind closed doors there was a tonne of euro-nail-biting.Poland and Hungary have long been viewed as the EU bad-boys: flawed democracies and EU-hostile.They were accused of flouting the bloc's democratic norms.In Poland's case, Brussels withheld billions of euros of funds, pointing at the Polish government taking away women's rights over their own bodies by virtually outlawing abortion, and threatening the independence of the judiciary and press freedom too by taking hold of the state broadcaster.Hungary and Poland also repeatedly stood in the way of agreeing new EU-wide measures to tackle migration and implementing ambitious EU climate goals.So far there are only exit polls to go on, but Brussels is doubly delighted at the expected outcome as it seems to buck a trend much-feared by the EU - the apparent renaissance of the Eurosceptic hard right across much of the bloc.Those forces are polling strongly in France, Austria and Germany. Populists just won the election in Slovakia.Civic Coalition promises to return to the European mainstream, though it won't be easy. The outgoing hard-line, conservative Law and Justice party is expected to retain a big chunk of parliamentary seats, limiting room for manoeuvre for Poland's new government.Still, when I spoke to European Commission Vice-President Margaritis Schinas, he was upbeat. He hoped the tensions \"haunting\" relations with Poland would now dissipate, describing Warsaw as a core member of the European family.Russia is another reason Brussels is keen to thaw frosty relations with Poland. Moscow sees any disunity amongst Ukraine's international backers as playing to its advantage.But Warsaw's tough line line against Russia was unlikely to waver, whoever won Sunday's election.It's a historic enmity. From that defence perspective, Nato was far more sanguine about Poland's election result than the EU.It does not want to be drawn into the domestic politics of national governments, but Warsaw has played an increasingly high-profile role in the military alliance since Russia's invasion of Ukraine,Nato's ambassador to the US, Julianne Smith, told me what she observed on visits to Poland was a dedication by the Polish people - not just the Polish government - to continue supporting Ukraine.\"They're right there. They border Ukraine, they feel this war differently than some of the other allies across the alliance.\"It's very close to their daily lives. And for that reason I think we can count on Poland, we feel quite comfortable with counting on them over the long term, irrespective of who might be in power.\"Even before the outspoken Donald Trump became US President, Washington was deeply frustrated that its European allies didn't spend more on defence. It's delighted Poland spends 3% of its GDP on making itself feel safer. And it's thought unlikely Civic Coalition will reverse that.In fact, Poland is so worried the war in Ukraine could spill over its borders, that it announced plans to invest in enough equipment and personnel to become Europe's strongest army by 2026.© 2023 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking.", "summary": null, "sentiment": null}