{"url": "https://www.bbc.com/news/world-us-canada-66715271?&at_bbc_team=studios&at_medium=native&at_objective=acquisition&at_ptr_type=&at_ptr_name=bbc.com&at_format=Module&at_link_origin=bbchomepage&at_campaign=nleditorial&at_campaign_id=&at_adset_name=&at_adset_id=&at_creation=&at_creative_id=&at_campaign_type=owned", "text": "Stories of true global significance told with expert insight by an unrivalled network of correspondents around the world.These are all hallmarks of BBC journalism - and now we are increasing the ways international readers can access this quality content at their fingertips.We offer expertly curated email newsletters that bring the best of the BBC direct to your inbox.And, from news to sport, our growing collection of subject areas means there is sure to be something for you.You can get your daily fix of global news from News Briefing. For news and gossip from the Premier League, Football Extra is the newsletter for you. Royal Watch gives the inside story on the Royal Family. The latest developments in global technology are in Tech Decoded. And The Essential List rounds up all the best features of the week.Some BBC newsletters are sent to readers every weekday, while others arrive weekly. What unites them is that they connect you to the BBC, give you perspectives you will not get elsewhere and help you discover articles you might otherwise have missed.Signing up is fast and straightforward - just click the links below and enter your details. These newsletters are available to readers outside the UK. For readers in the UK, sign up to newsletters here.I really hope you enjoy our newsletters. The number we offer is growing all the time, so keep your eyes peeled for more soon.I am keen to hear what you, our valued readers, think - so please email me with any feedback or suggestions.Never miss the news that matters, with our essential guide to the world's top stories in this flagship twice-daily newsletter.News Briefing bookends your day, providing top headlines and expert analysis from the BBC's correspondents around the globe.It offers expert insights and on-the-ground reporting to help you feel at the heart of our coverage.This smart shop window to the best of BBC News is sent seven days a week - becoming a simple headlines digest of our main stories at weekends, allowing you to see what is making the news at a glance.Click here to sign up.Let BBC Sport be your companion to the Premier League and give you an edge with the latest news, insights and gossip. Football Extra arrives in inboxes every weekday - hosted by Pat Nevin, the former Chelsea, Everton and Scotland winger turned analyst, every Monday and from the wider BBC Football squad on other days.Click here to sign up.Get the inside story on the Royal Family every Thursday, with expert analysis and behind-the-scenes insights from royal correspondent Sean Coughlan.Click here to sign up.Decode the biggest developments in technology, with exclusive insights and analysis from the tech hubs of the world. Bookending your week, North America Tech Reporter James Clayton looks ahead at what is driving the agenda on Monday - while Friday's edition showcases a dispatch on emerging tech from a correspondent elsewhere in the world.Click here to sign up.Lean back and catch up with our hand-picked selection of the best of BBC features. The smartest, sharpest articles and videos are chosen for you by our world-class editors.This email newsletter delivers a weekly slice of the best features, videos and can't-miss news, direct to your inbox every Friday - read it now or save for the weekend.Click here to sign up.© 2023 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking.", "summary": null, "sentiment": null}